{
    "polemics": {
      "Islam": {
        "1": "The Trinity contradicts monotheism (Tawhid) and was not taught by Jesus.",
        "2": "Jesus never explicitly claimed to be God in the Bible.",
        "3": "The Bible has been corrupted and contains contradictions.",
        "4": "Jesus was not crucified; someone else was made to look like him.",
        "5": "Paul distorted Jesus’ original message and created Christianity.",
        "6": "The Bible prophesies the coming of Muhammad (Deuteronomy 18:18, John 14:16).",
        "7": "The Gospel of Barnabas is the true account of Jesus' life, which supports Islam.",
        "8": "The concept of original sin is unjust; humans should not inherit sin.",
        "9": "Jesus prayed to God (Matthew 26:39), proving he was not God.",
        "10": "God does not need a son; He is self-sufficient.",
        "11": "Christianity borrows heavily from pagan beliefs (e.g., dying and rising gods).",
        "12": "Jesus was a prophet sent to guide the Israelites, not the whole world.",
        "13": "Christians ignore the dietary laws given by God (Leviticus 11).",
        "14": "The Bible endorses polytheism with phrases like 'Let us make man in our image' (Genesis 1:26).",
        "15": "The crucifixion is unnecessary because God can forgive without sacrifice.",
        "16": "Christianity was influenced by Roman paganism and Greek philosophy.",
        "17": "Jesus’ second coming is described differently in Islam and Christianity.",
        "18": "The Bible has been revised multiple times, proving its unreliability.",
        "19": "Jesus' miracles were given by God, not proof of divinity.",
        "20": "Christianity divides God into three, whereas Islam keeps God as one."
      },
      "Seventh-day Adventists": {
        "1": "Sunday worship is a man-made tradition; the true Sabbath is Saturday.",
        "2": "Hell is not eternal; sinners will be destroyed, not tormented forever.",
        "3": "The Catholic Church is the 'Beast' of Revelation promoting false doctrines.",
        "4": "The dead are unconscious (soul sleep) until the resurrection.",
        "5": "The Ten Commandments, including the Sabbath, are still binding.",
        "6": "The doctrine of the immortal soul is not biblical.",
        "7": "Sunday laws will be enforced as the 'Mark of the Beast' in the end times.",
        "8": "Jesus entered the heavenly sanctuary in 1844 to begin the investigative judgment.",
        "9": "The Bible, not tradition, is the sole authority in Christian faith.",
        "10": "Health laws, including vegetarianism, are part of God’s plan.",
        "11": "Jesus’ return is imminent, and signs of the end are being fulfilled.",
        "12": "The Trinity doctrine is misunderstood; the Father, Son, and Holy Spirit are distinct but unified.",
        "13": "Baptism by immersion is the only valid form of baptism.",
        "14": "The state of the dead refutes spiritualism and communication with spirits.",
        "15": "Satan will ultimately bear the sins of the world as the scapegoat.",
        "16": "The judgment of believers is currently happening in heaven.",
        "17": "Christians should avoid worldly entertainment and materialism.",
        "18": "The early church did not celebrate Christmas or Easter.",
        "19": "The Protestant Reformation should have continued rejecting unbiblical doctrines.",
        "20": "God calls people out of false churches to return to biblical faith."
      },
      "Mormons (Latter-day Saints)": {
        "1": "The Bible is incomplete and has been corrupted over time.",
        "2": "The Book of Mormon is another testament of Jesus Christ and restores lost truths.",
        "3": "God has a physical body and is not just a spirit.",
        "4": "The Father, Son, and Holy Spirit are three separate beings, not one.",
        "5": "Salvation requires works, including baptism, not just faith.",
        "6": "Marriage is eternal; families can be together forever.",
        "7": "Baptism for the dead allows salvation for those who never heard the gospel.",
        "8": "The original church had prophets and apostles, which were lost but restored in Mormonism.",
        "9": "The true church must have a modern prophet to guide it.",
        "10": "Heaven has three degrees of glory, not just heaven and hell.",
        "11": "God was once a man and progressed to godhood.",
        "12": "Humans can become gods through exaltation.",
        "13": "The Great Apostasy led to the loss of true Christianity until Joseph Smith restored it.",
        "14": "Modern revelation continues through living prophets.",
        "15": "Jesus visited the Americas after his resurrection.",
        "16": "The priesthood authority was lost after the apostles but restored in Mormonism.",
        "17": "The true church must follow the law of tithing.",
        "18": "Christian creeds are corrupt and do not reflect true doctrine.",
        "19": "The Holy Ghost provides personal revelation and guidance.",
        "20": "The end times will see a literal gathering of Israel before Christ’s return."
      },
      "Jehovah's Witnesses": {
        "1": "Jesus is not God but Jehovah’s first creation (Michael the Archangel).",
        "2": "The Trinity is a false doctrine added later in Christianity.",
        "3": "Hell does not exist; the wicked will cease to exist.",
        "4": "The cross is a pagan symbol; Jesus died on a stake.",
        "5": "Only 144,000 people go to heaven; the rest live on Earth.",
        "6": "Blood transfusions violate God’s law.",
        "7": "God’s name is Jehovah and must be used in worship.",
        "8": "The end times began in 1914 when Jesus started ruling in heaven.",
        "9": "Christians must reject worldly governments and be neutral in politics.",
        "10": "Birthdays and holidays are pagan and should not be celebrated.",
        "11": "Jesus was resurrected as a spirit, not in a physical body.",
        "12": "The soul is not immortal but ceases to exist after death.",
        "13": "Jehovah’s Witnesses are the only true Christian group.",
        "14": "Worldly churches are under Satan’s control.",
        "15": "The Bible should only be interpreted through Jehovah’s Witnesses’ teachings.",
        "16": "Christian symbols like the cross are idolatrous.",
        "17": "Secular education is discouraged as it distracts from service to Jehovah.",
        "18": "Door-to-door preaching is a requirement for salvation.",
        "19": "Jesus' return will bring an earthly paradise.",
        "20": "God’s kingdom will destroy all human governments soon."
      },
      "Atheists": {
        "1": "There is no empirical evidence for God’s existence.",
        "2": "The Bible is full of contradictions and errors.",
        "3": "Evolution disproves the biblical creation story.",
        "4": "The problem of evil disproves an all-loving, all-powerful God.",
        "5": "Religions were created by humans to control people.",
        "6": "Jesus' existence is questionable or a myth.",
        "7": "Faith is believing without evidence, which is irrational.",
        "8": "Scientific discoveries continue to replace religious explanations.",
        "9": "Morality exists without God and is based on human well-being.",
        "10": "Hell is a fear tactic to control believers.",
        "11": "Religious wars and persecution show the harm of faith.",
        "12": "Prayer has no measurable effect.",
        "13": "Religions contradict each other, proving they are man-made.",
        "14": "Christianity borrowed from older religions like Mithraism.",
        "15": "The resurrection is unverified and based on legend.",
        "16": "The Gospels were written long after Jesus' death and contain myths.",
        "17": "Near-death experiences are not proof of an afterlife.",
        "18": "The Bible promotes slavery and genocide.",
        "19": "Christianity spreads guilt and shame rather than personal growth.",
        "20": "Religion discourages critical thinking and scientific progress."
      }
    }
  }
  